/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   dot_vector3d.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rnaito <rnaito@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/09/24 15:45:31 by rnaito            #+#    #+#             */
/*   Updated: 2023/10/13 17:44:41 by rnaito           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "types.h"

/**
 * ベクトルの内積（ドット積）を求める関数
 * 
 * 内積により、2つのベクトルの成す角度がわかる
 * 内積の範囲は -1 ~ 1であり、ベクトル同士が類似するほど大きな値をとる
 * ex. (内積, 角度) = (-1, 180度)、(0, 90度)、(1, 0度)
*/
double	dot_vector3d(const t_vector3d a, const t_vector3d b)
{
	return (a.x * b.x + a.y * b.y + a.z * b.z);
}
